{
  "namespace": "cvss",
  "key": "DT_CVSS_EQ5",
  "version": "1.0.0",
  "name": "CVSS v4 Equivalence Set 5",
  "description": "CVSS Equivalence Set 5 Decision Table",
  "schemaVersion": "2.0.0",
  "decision_points": {
    "cvss:E:2.0.0": {
      "namespace": "cvss",
      "key": "E",
      "version": "2.0.0",
      "name": "Exploit Maturity",
      "description": "This metric measures the likelihood of the vulnerability being attacked, and is based on the current state of exploit techniques, exploit code availability, or active, “in-the-wild” exploitation.",
      "schemaVersion": "2.0.0",
      "values": [
        {
          "key": "U",
          "name": "Unreported",
          "description": "Based on available threat intelligence each of the following must apply: No knowledge of publicly available proof-of-concept exploit code No knowledge of reported attempts to exploit this vulnerability No knowledge of publicly available solutions used to simplify attempts to exploit the vulnerability (i.e., neither the “POC” nor “Attacked” values apply)"
        },
        {
          "key": "P",
          "name": "Proof-of-Concept",
          "description": "Based on available threat intelligence each of the following must apply: Proof-of-concept exploit code is publicly available No knowledge of reported attempts to exploit this vulnerability No knowledge of publicly available solutions used to simplify attempts to exploit the vulnerability (i.e., the “Attacked” value does not apply)"
        },
        {
          "key": "A",
          "name": "Attacked",
          "description": "Based on available threat intelligence either of the following must apply: Attacks targeting this vulnerability (attempted or successful) have been reported Solutions to simplify attempts to exploit the vulnerability are publicly or privately available (such as exploit toolkits)"
        },
        {
          "key": "X",
          "name": "Not Defined",
          "description": "This metric value is not defined. See CVSS documentation for details."
        }
      ]
    },
    "cvss:EQ5:1.0.0": {
      "namespace": "cvss",
      "key": "EQ5",
      "version": "1.0.0",
      "name": "Equivalence Set 5",
      "description": "E with 3 levels specified in Table 28",
      "schemaVersion": "2.0.0",
      "values": [
        {
          "key": "L",
          "name": "Low",
          "description": "2: E:U"
        },
        {
          "key": "M",
          "name": "Medium",
          "description": "1: E:P"
        },
        {
          "key": "H",
          "name": "High",
          "description": "0: E:A"
        }
      ]
    }
  },
  "outcome": "cvss:EQ5:1.0.0",
  "mapping": [
    {
      "cvss:E:2.0.0": "U",
      "cvss:EQ5:1.0.0": "L"
    },
    {
      "cvss:E:2.0.0": "P",
      "cvss:EQ5:1.0.0": "M"
    },
    {
      "cvss:E:2.0.0": "A",
      "cvss:EQ5:1.0.0": "H"
    }
  ]
}
