{
  "namespace": "ssvc",
  "key": "DT_PSI",
  "version": "1.0.0",
  "name": "Public Safety Impact",
  "definition": "Public Safety Impact Decision Table",
  "schemaVersion": "2.0.0",
  "decision_points": {
    "ssvc:SI:2.0.0": {
      "namespace": "ssvc",
      "key": "SI",
      "version": "2.0.0",
      "name": "Safety Impact",
      "definition": "The safety impact of the vulnerability. (based on IEC 61508)",
      "schemaVersion": "2.0.0",
      "values": [
        {
          "key": "N",
          "name": "Negligible",
          "definition": "Any one or more of these conditions hold.<br/><br/>- *Physical harm*: Minor injuries at worst (IEC 61508 Negligible).<br/>- *Operator resiliency*: Requires action by system operator to maintain safe system state as a result of exploitation of the vulnerability where operator actions would be well within expected operator abilities; OR causes a minor occupational safety hazard.<br/>- *System resiliency*: Small reduction in built-in system safety margins; OR small reduction in system functional capabilities that support safe operation.<br/>- *Environment*: Minor externalities (property damage, environmental damage, etc.) imposed on other parties.<br/>- *Financial*: Financial losses, which are not readily absorbable, to multiple persons.<br/>- *Psychological*: Emotional or psychological harm, sufficient to be cause for counselling or therapy, to multiple persons."
        },
        {
          "key": "M",
          "name": "Marginal",
          "definition": "Any one or more of these conditions hold.<br/><br/>- *Physical harm*: Major injuries to one or more persons (IEC 61508 Marginal).<br/>- *Operator resiliency*: Requires action by system operator to maintain safe system state as a result of exploitation of the vulnerability where operator actions would be within their capabilities but the actions require their full attention and effort; OR significant distraction or discomfort to operators; OR causes significant occupational safety hazard.<br/>- *System resiliency*: System safety margin effectively eliminated but no actual harm; OR failure of system functional capabilities that support safe operation.<br/>- *Environment*: Major externalities (property damage, environmental damage, etc.) imposed on other parties.<br/>- *Financial*: Financial losses that likely lead to bankruptcy of multiple persons.<br/>- *Psychological*: Widespread emotional or psychological harm, sufficient to be cause for counselling or therapy, to populations of people."
        },
        {
          "key": "R",
          "name": "Critical",
          "definition": "Any one or more of these conditions hold.<br/><br/>- *Physical harm*: Loss of life (IEC 61508 Critical).<br/>- *Operator resiliency*: Actions that would keep the system in a safe state are beyond system operator capabilities, resulting in adverse conditions; OR great physical distress to system operators such that they cannot be expected to operate the system properly.<br/>- *System resiliency*: Parts of the cyber-physical system break; system’s ability to recover lost functionality remains intact.<br/>- *Environment*: Serious externalities (threat to life as well as property, widespread environmental damage, measurable public health risks, etc.) imposed on other parties.<br/>- *Financial*: Socio-technical system (elections, financial grid, etc.) of which the affected component is a part is actively destabilized and enters unsafe state.<br/>- *Psychological*: N/A."
        },
        {
          "key": "C",
          "name": "Catastrophic",
          "definition": "Any one or more of these conditions hold.<br/><br/>- *Physical harm*: Multiple loss of life (IEC 61508 Catastrophic).<br/>- *Operator resiliency*: Operator incapacitated (includes fatality or otherwise incapacitated).<br/>- *System resiliency*: Total loss of whole cyber-physical system, of which the software is a part.<br/>- *Environment*: Extreme externalities (immediate public health threat, environmental damage leading to small ecosystem collapse, etc.) imposed on other parties.<br/>- *Financial*: Social systems (elections, financial grid, etc.) supported by the software collapse.<br/>- *Psychological*: N/A."
        }
      ]
    },
    "ssvc:PSI:2.0.1": {
      "namespace": "ssvc",
      "key": "PSI",
      "version": "2.0.1",
      "name": "Public Safety Impact",
      "definition": "A coarse-grained representation of impact to public safety.",
      "schemaVersion": "2.0.0",
      "values": [
        {
          "key": "M",
          "name": "Minimal",
          "definition": "Safety Impact:Negligible"
        },
        {
          "key": "S",
          "name": "Significant",
          "definition": "Safety Impact:(Marginal OR Critical OR Catastrophic)"
        }
      ]
    }
  },
  "outcome": "ssvc:PSI:2.0.1",
  "mapping": [
    {
      "ssvc:SI:2.0.0": "N",
      "ssvc:PSI:2.0.1": "M"
    },
    {
      "ssvc:SI:2.0.0": "M",
      "ssvc:PSI:2.0.1": "S"
    },
    {
      "ssvc:SI:2.0.0": "R",
      "ssvc:PSI:2.0.1": "S"
    },
    {
      "ssvc:SI:2.0.0": "C",
      "ssvc:PSI:2.0.1": "S"
    }
  ]
}
