{
  "namespace": "cisa#nciss",
  "key": "OAL",
  "version": "1.0.0",
  "name": "Observed Activity Location",
  "definition": "The location of observed activity describes where the observed activity was detected in the network. ",
  "schemaVersion": "2.0.0",
  "values": [
    {
      "key": "0",
      "name": "Unsuccessful",
      "definition": "Existing network defenses repelled all observed activity."
    },
    {
      "key": "1",
      "name": "Business Demilitarized Zone",
      "definition": "Activity was observed in the business network’s demilitarized zone (DMZ). These systems are generally untrusted and are designed to be exposed to the Internet."
    },
    {
      "key": "2",
      "name": "Business Network",
      "definition": "Activity was observed in the business or corporate network of the victim. These systems would be corporate user workstations, application servers, and other non-core management systems."
    },
    {
      "key": "3",
      "name": "Business Network Management",
      "definition": "Activity was observed in business network management systems such as administrative user workstations, active directory servers, or other trust stores."
    },
    {
      "key": "4",
      "name": "Critical System DMZ",
      "definition": "Activity was observed in the DMZ that exists between the business network and a critical system network. These systems may be internally facing services such as SharePoint sites, financial systems, or relay “jump” boxes into more critical systems."
    },
    {
      "key": "5",
      "name": "Critical System Management",
      "definition": "Activity was observed in high-level critical systems management such as human-machine interfaces (HMIs) in industrial control systems."
    },
    {
      "key": "6",
      "name": "Critical Systems",
      "definition": "Activity was observed in the critical systems that operate critical processes, such as programmable logic controllers in industrial control system environments."
    },
    {
      "key": "7",
      "name": "Safety Systems",
      "definition": "Activity was observed in critical safety systems that ensure the safe operation of an environment. One example of a critical safety system is a fire suppression system."
    },
    {
      "key": "U",
      "name": "Unknown",
      "definition": "Activity was observed, but the network segment could not be identified."
    }
  ]
}
